case_openfoam10_scent/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  10
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Using scalarTransportFoam - available in OpenFOAM 10
application     scalarTransportFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         5;          // Short 5-second simulation

// Fixed small time step for maximum stability
deltaT          0.005;      // Very conservative time step
adjustTimeStep  no;         // Fixed time step prevents instabilities

writeControl    timeStep;
writeInterval   100;        // Write every 0.5 seconds (100 * 0.005)

purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
