case_openfoam10_scent/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  10
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Molecular diffusivity for the scent/tracer (OpenFOAM 10 format)
DT              DT [0 2 -1 0 0 0 0] 2e-05;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
