case_openfoam10_scent/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  10
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Transport properties for passive scalar
transportModel  Newtonian;

// Kinematic viscosity (from original flow simulation)
nu              [0 2 -1 0 0 0 0] 1e-05;

// Molecular diffusivity for the scent/tracer
// Using realistic value for typical gas-phase molecular diffusion
DT              [0 2 -1 0 0 0 0] 2e-05;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
