case_openfoam10_scent/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  10
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];    // Dimensionless concentration

// Initialize entire domain to zero concentration
internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.0;    // Scent source: contaminated air entering
    }
    
    outlet
    {
        type            zeroGradient;   // Natural outflow
    }
    
    ground
    {
        type            zeroGradient;   // No flux through ground
    }
    
    atmosphere
    {
        type            zeroGradient;   // Natural atmospheric boundary
    }
    
    debris
    {
        type            zeroGradient;   // No flux through debris walls
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
